const PrivacyText: string = `[Notibook은 회원가입 및 서비스 이용을 위해 아래와 같은 개인정보를 수집하고 있습니다.]
 * 필수항목: 이름, 이메일 주소, 비밀번호
 * 선택항목: 없음

1. 서비스 이용과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다:
 * IP 주소, 쿠키, 접속 브라우저, 서비스 이용기록

=======================================
[개인정보 수집 및 이용목적]
Notibook은 수집한 개인정보를 다음의 목적을 위해 활용하며 다른 용도로는 사용되지 않습니다. 차후 이용목적이 변경될 시에는 사전에 동의를 구합니다.
 * 이메일 주소, 비밀번호: 서비스 이용에 따른 본인식별, 중복가입 확인, 부정이용 방지를 위해 사용됩니다.
 * 이름: 서비스 내에서의 단순 표시 목적

=======================================
[개인정보의 보유 및 이용기간]
Notibook은 회원가입일로부터 서비스를 제공하는 기간 동안에 한하여 이용자의 개인정보를 보유 및 이용합니다. 회원탈퇴는 develretr0@dgsw.hs.kr을 통해 서면상으로 요청할 수 있으며, 회원탈퇴 시 즉시 모든 정보를 파기합니다.

=======================================
[개인정보의 파기절차 및 방법]
원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.

 1. 파기절차: 회원이 회원가입 등을 위해 입력하신 정보는 목적이 달성된 후 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기되어집니다. 일정기간 저장된 개인정보는 법령에 의한 경우를 제외하고는 보유 목적 이외의 다른 목적으로 이용되지 않습니다.
 2. 파기방법: 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.

=======================================
[개인정보 제공]
Notibook은 이용자의 개인정보를 원칙적으로 외부에 제공하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.
 * 이용자들이 사전에 동의한 경우
 * 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우

=======================================
[수집한 개인정보의 처리위탁]
Notibook은 서비스의 원활한 운영을 위해 다음과 같은 개인정보를 제 3국의 기업에 위임하고 있습니다.

 * 이전되는 개인정보 항목 및 수집방법:
   * Notibook 서비스에서 수집하는 개인정보 전체
 * 이전일시: 회원가입 시 즉시
 * 이전 방법: 온라인
 * 이전 받는 자: Microsoft Azure
 * 정보관리책임자의 연락처: 네덜란드, Agriport 601, Middenmeer / 아일랜드, Leopardstown, Dublin (azuresupport@microsoft.com)
 * 위탁 업무: 서버 호스팅
 * 기간: 회원 탈퇴 시 혹은 위탁 계약 종료 시까지

=======================================
[회원 및 법정대리인의 권리와 그 행사방법]
이용자 및 법정 대리인은 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다. 이용자의 개인정보 조회, 수정, 가입해지(동의철회)를 위해서는 개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체 없이 조치하겠습니다.
이용자가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다.

=======================================
[개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항]
쿠키는 웹사이트를 운영하는데 이용되는 서버가 이용자의 브라우저에 보내는 아주 작은 텍스트 파일로서 이용자의 컴퓨터에 저장됩니다. 보다 빠르고 편리한 웹사이트 사용을 지원하고 맞춤형 서비스를 제공하기 위해 사용됩니다.
쿠키 등 사용 목적 이용자가 선호하는 설정 등을 저장하여 보다 빠른 웹 환경을 지원하며, 편리한 이용을 위해 서비스 개선에 활용합니다. 쿠키 설정 거부 방법 이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 이용자는 웹 브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 모든 쿠키의 저장을 거부할 수도 있습니다. 다만, 쿠키의 저장을 거부할 경우에는 로그인이 필요한 일부 서비스는 이용에 어려움이 있을 수 있습니다.

=======================================
[개인정보의 기술적, 관리적 보호대책]
Notibook은 이용자의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지 않도록 안정성 확보를 위해 다음과 같은 기술적, 관리적 대책을 강구하고 있습니다.
 1. 비밀번호 암호화: 이용자의 개인정보를 암호화된 통신구간을 이용하여 전송하고, 비밀번호 등 중요정보는 암호화하여 보관하고 있습니다.
 2. 해킹 등의 대비한 기술적 대책
 해킹이나 컴퓨터 바이러스 등에 의해 이용자의 개인정보가 유출되거나 훼손되는 것을 막기 위해 외부로부터 접근이 통제된 구역에 시스템을 설치하고 있습니다. 해커 등의 침입을 탐지하고 차단할 수 있는 시스템을 설치하여 24시간 감시하고 있으며, 백신 프로그램을 설치하여 시스템이 최신 악성코드나 바이러스에 감염되지 않도록 노력하고 있습니다.
 3. 개인 아이디와 비밀번호의 관리: 이용자가 사용하는 아이디와 비밀번호는 원칙적으로 이용자만이 사용할 수 있도록 되어 있습니다. Notibook은 이용자의 개인적인 부주의로 아이디, 비밀번호 등 개인정보가 유출되어 발생한 문제와 기본적인 인터넷의 위험성 때문에 일어나는 일들에 대해 책임을 지지 않습니다. 비밀번호에 대한 보안의식을 가지고 비밀번호를 자주 변경하며, 타인이 알기 쉬운 비밀번호를 사용하거나, 공용 PC 에서의 로그인시 개인정보가 누출되지 않도록 각별한 주의를 기울여 주시기 바랍니다.

=======================================
[동의를 거부할 권리 및 동의를 거부할 경우의 불이익]
귀하는 동의를 거부할 권리가 있으며, 동의를 거부할 경우 해당 서비스를 사용할 수 없습니다.

=======================================
[부칙]
이 개인정보처리방침은 2023년 6월 6일부터 적용되며, 법령, 정책 또는 보안기술의 변경에 따라 내용의 추가, 삭제 및 수정이 있을 시에는 변경사항의 시행일의 7일 전부터 문산수억고등학교의 담당 교사를 통하여 서면 혹은 구두 상으로 고지할 것입니다.`

export default PrivacyText